app/Controllers/Home.php

    public function list_form3(): string
    {
        $data = [
            'form3data' => $this->Form3Model->orderBy('id', 'DESC')->findAll()
        ];
---
SELECT *
FROM `form3`
ORDER BY `id` DESC

    public function save_form3(): RedirectResponse
    {
        $data = $this->request->getVar();
        $dataTemp = $this->request->getVar();

        unset($data['tgl_partus']);
        unset($data['tempat_partus']);
        unset($data['umur_hamil']);
        unset($data['jenis_persalinan']);
        unset($data['penolong_persalinan']);
        unset($data['penyulit']);
        unset($data['jkbb']);
        unset($data['keadaan_anak']);
        // dd($data);
        $this->Form3Model->insert($data);
        $id = $this->Form3Model->insertID();

        for ($i = 0; $i < count($dataTemp['tgl_partus']); $i++) {
            $this->Form3PersalinanModel->insert([
                'tgl_partus' => $dataTemp['tgl_partus'][$i],
                'tempat_partus' => $dataTemp['tempat_partus'][$i],
                'umur_hamil' => $dataTemp['umur_hamil'][$i],
                'jenis_persalinan' => $dataTemp['jenis_persalinan'][$i],
                'penolong_persalinan' => $dataTemp['penolong_persalinan'][$i],
                'penyulit' => $dataTemp['penyulit'][$i],
                'jkbb' => $dataTemp['jkbb'][$i],
                'keadaan_anak' => $dataTemp['keadaan_anak'][$i],
                'form3_id' => $id,
            ]);
---
INSERT INTO `form3_persalinan` (`tgl_partus`, `tempat_partus`, `umur_hamil`, `jenis_persalinan`, `penolong_persalinan`, `penyulit`, `jkbb`, `keadaan_anak`, `form3_id`) VALUES ('', '', '', '', '', '', '', '', 1)

    public function downloadForm3($id)
    {
        $data = $this->Form3Model->find($id);
        $data['tabel'] = $this->Form3PersalinanModel->where('form3_id ', $id)->findAll();
---
SELECT *
FROM `form3`
WHERE `form3`.`id` = '1'
SELECT *
FROM `form3_persalinan`
WHERE `form3_id` = '1'

    public function list_form4(): string
    {
        $data = [
            'form4data' => $this->Form4Model->orderBy('id', 'DESC')->findAll()
        ];
---
SELECT *
FROM `form4`
ORDER BY `id` DESC

    public function downloadForm4($id)
    {
        $data = $this->Form4Model->find($id);
        $data['tabel'] = $this->Form4TableModel->where('form4_id', $id)->findAll();
---
SELECT *
FROM `form4`
WHERE `form4`.`id` = '2'
SELECT *
FROM `form4table`
WHERE `form4_id` = '2'

    public function downloadForm6($id)
    {
        $data = $this->Form6Model->find($id);
---
SELECT *
FROM `form6`
WHERE `form6`.`id` = '2'

    public function downloadForm7($id)
    {
        $data = $this->Form7Model->find($id);
---
SELECT *
FROM `form7`
WHERE `form7`.`id` = '2'

    public function list_form8(): string
    {
        $data = [
            'form8data' => $this->Form8Model->orderBy('id', 'DESC')->findAll()
        ];
---
SELECT *
FROM `form8`
ORDER BY `id` DESC

    public function downloadForm8($id)
    {
        $data = $this->Form8Model->find($id);
---
SELECT *
FROM `form8`
WHERE `form8`.`id` = '1'

    public function downloadForm9($id)
    {
        $data = $this->Form9Model->find($id);
---
SELECT *
FROM `form9`
WHERE `form9`.`id` = '1'